nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/drivers/fsl_power.h
/*
 * Copyright 2023-2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#ifndef FSL_POWER_H_
#define FSL_POWER_H_

#include "fsl_common.h"

/*!
 * @addtogroup power
 * @{
 */

/*!*****************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief power driver version 2.3.0. */
#define FSL_POWER_DRIVER_VERSION (MAKE_VERSION(2, 3, 0))
/*@}*/

/* Define the default PMIC modes for power modes. */
#ifndef POWER_DEFAULT_PMICMODE_DS
#define POWER_DEFAULT_PMICMODE_DS 1U
#endif
#ifndef POWER_DEFAULT_PMICMODE_DSR
#define POWER_DEFAULT_PMICMODE_DSR 1U
#endif
#ifndef POWER_DEFAULT_PMICMODE_DPD
#define POWER_DEFAULT_PMICMODE_DPD 2U
#endif
#ifndef POWER_DEFAULT_PMICMODE_FDPD
#define POWER_DEFAULT_PMICMODE_FDPD 3U
#endif

#define MAKE_PD_BITS(reg, slot)   (((reg) << 8) | (slot))
#define GET_PD_REG_FROM_BITS(bit) (((uint32_t)(bit) >> 8U) & 0xFFU)

#define SLEEPCON_RCFG 0x0U
#define PMC_PDRCFG0   0x1U
#define PMC_PDRCFG1   0x2U
#define PMC_PDRCFG2   0x3U
#define PMC_PDRCFG3   0x4U
#define PMC_PDRCFG4   0x5U
#define PMC_PDRCFG5   0x6U

/*! @brief Power down control bits defined in SLEEPCON and PMC. */
typedef enum pd_bits
{
#if defined(PMC0)
    kPDRUNCFG_SHUT_COMPT_MAINCLK = MAKE_PD_BITS(SLEEPCON_RCFG, 0U), /*!< VDD2_COMP Domain Main Clock Shut Off. */
#endif
    kPDRUNCFG_SHUT_SENSEP_MAINCLK =
        MAKE_PD_BITS(SLEEPCON_RCFG, 1U), /*!< The Private Part in VDD1_SENSE Main Clock Shut Off. */
    kPDRUNCFG_SHUT_SENSES_MAINCLK =
        MAKE_PD_BITS(SLEEPCON_RCFG, 2U), /*!< The Shared Part in VDD1_SENSE Main Clock Shut Off. */
    kPDRUNCFG_SHUT_RAM0_CLK      = MAKE_PD_BITS(SLEEPCON_RCFG, 3U), /*!< Main Clock of RAM Arbiter 0 Shut Off. */
    kPDRUNCFG_SHUT_RAM1_CLK      = MAKE_PD_BITS(SLEEPCON_RCFG, 4U), /*!< Main Clock of RAM Arbiter 1 shut off. */
    kPDRUNCFG_SHUT_COMNN_MAINCLK = MAKE_PD_BITS(SLEEPCON_RCFG, 5U), /*!< VDDN_COM Domain Main Clock Shut Off. */
    kPDRUNCFG_SHUT_MEDIA_MAINCLK =
        MAKE_PD_BITS(SLEEPCON_RCFG, 6U), /*!< VDD2_MEDIA and VDDN_MEDIA Domains Main Clock of Shut Off. */
    kPDRUNCFG_PD_SYSXTAL = MAKE_PD_BITS(SLEEPCON_RCFG, 7U),    /*!< Xtal Oscillator Power Down. */
#if defined(PMC0)
    kPDRUNCFG_PD_FRO0 = MAKE_PD_BITS(SLEEPCON_RCFG, 8U),       /*!< FRO0 Power Down. */
    kPDRUNCFG_PD_FRO1 = MAKE_PD_BITS(SLEEPCON_RCFG, 9U),       /*!< FRO1 Power Down. */
#endif
    kPDRUNCFG_PD_FRO2      = MAKE_PD_BITS(SLEEPCON_RCFG, 10U), /*!< FRO2 Power Down. */
    kPDRUNCFG_PD_LPOSC     = MAKE_PD_BITS(SLEEPCON_RCFG, 11U), /*!< LPOSC Power Down. */
    kPDRUNCFG_PD_PLLANA    = MAKE_PD_BITS(SLEEPCON_RCFG, 12U), /*!< Main PLL Analog Function Power Down. */
    kPDRUNCFG_PD_PLLLDO    = MAKE_PD_BITS(SLEEPCON_RCFG, 13U), /*!< Main PLL Internal Regulator Power Down. */
    kPDRUNCFG_PD_AUDPLLANA = MAKE_PD_BITS(SLEEPCON_RCFG, 14U), /*!< Audio PLL Analog Function Power Down. */
    kPDRUNCFG_PD_AUDPLLLDO = MAKE_PD_BITS(SLEEPCON_RCFG, 15U), /*!< Audio PLL Internal Regulator Power Down. */
    kPDRUNCFG_PD_ADC0      = MAKE_PD_BITS(SLEEPCON_RCFG, 16U), /*!< ADC0 Power Down, 1 - Applies gating. */
#if defined(PMC0)
    kPDRUNCFG_GATE_FRO0 = MAKE_PD_BITS(SLEEPCON_RCFG, 29U),    /*!< FRO0 Gating, 1 - Applies gating. */
#endif
    kPDRUNCFG_GATE_FRO2 = MAKE_PD_BITS(SLEEPCON_RCFG, 31U),    /*!< FRO2 Gating, 1 - Applies gating. */
    kPDRUNCFG_DSR_VDD2N_MEDIA =
        MAKE_PD_BITS(PMC_PDRCFG0, 6U), /*!< Power Switch and DSR Enable for the VDD2_MEDIA and VDDN_MEDIA domains. */
    kPDRUNCFG_DSR_VDDN_COM = MAKE_PD_BITS(PMC_PDRCFG0, 8U), /*!< Power Switch and DSR Enable for the VDDN_COM domain. */
    kPDRUNCFG_PD_VDD2_DSP  = MAKE_PD_BITS(PMC_PDRCFG0, 9U), /*!< Power switch for the HiFi4 DSP. */
    kPDRUNCFG_PD_VDD2_MIPI = MAKE_PD_BITS(PMC_PDRCFG0, 10U),        /*!< Power Switch for the MIPI PHY. */
    kPDRUNCFG_LP_DCDC      = MAKE_PD_BITS(PMC_PDRCFG0, 12U),        /*!< DCDC Low-Power Mode. */
    kPDRUNCFG_PD_RBB_VDD1  = MAKE_PD_BITS(PMC_PDRCFG0, 22U),        /*!< Power Down RBB in VDD1. */
    kPDRUNCFG_PD_AFBB_VDD1 = MAKE_PD_BITS(PMC_PDRCFG0, 23U),        /*!< Power Down AFBB in VDD1 Domain. */
    kPDRUNCFG_PD_RBB_VDD2  = MAKE_PD_BITS(PMC_PDRCFG0, 24U),        /*!< Power Down RBB in VDD2 Domain.*/
    kPDRUNCFG_PD_AFBB_VDD2 = MAKE_PD_BITS(PMC_PDRCFG0, 25U),        /*!< Power Down AFBB in VDD2 Domain.*/
    kPDRUNCFG_PD_RBB_VDDN  = MAKE_PD_BITS(PMC_PDRCFG0, 26U),        /*!< Power Down RBB in VDDN Domain.*/
    kPDRUNCFG_PD_AFBB_VDDN = MAKE_PD_BITS(PMC_PDRCFG0, 27U),        /*!< Power Down RBB in VDDN Domain.*/
    kPDRUNCFG_PD_SRAM_RBB_VDD1    = MAKE_PD_BITS(PMC_PDRCFG0, 28U), /*!< Power Down SRAM RBB in VDD1 Domain. */
    kPDRUNCFG_PD_SRAM_RBB_VDD2    = MAKE_PD_BITS(PMC_PDRCFG0, 29U), /*!< Power Down SRAM RBB in VDD2 Domain. */
    kPDRUNCFG_PD_SRAM_AFBB_VDD2   = MAKE_PD_BITS(PMC_PDRCFG0, 31U), /*!< Power Down SRAM AFBB in VDD2 Domain.*/
    kPDRUNCFG_PD_PMC_TEMPSNS      = MAKE_PD_BITS(PMC_PDRCFG1, 0U),  /*!< Power Down PMC Temperature Sensor.*/
    kPDRUNCFG_LP_PMCREF           = MAKE_PD_BITS(PMC_PDRCFG1, 1U),  /*!< PMC References in Low-Power Mode.*/
    kPDRUNCFG_PD_HVD1V8           = MAKE_PD_BITS(PMC_PDRCFG1, 2U),  /*!< HVD Power Down.*/
    kPDRUNCFG_LP_POR_VDD1         = MAKE_PD_BITS(PMC_PDRCFG1, 3U),  /*!< POR Low-Power Mode in VDD1 Domain.*/
    kPDRUNCFG_LP_LVD_VDD1         = MAKE_PD_BITS(PMC_PDRCFG1, 4U),  /*!< LVD Low-Power Mode in VDD1 Domain.*/
    kPDRUNCFG_PD_HVD_VDD1         = MAKE_PD_BITS(PMC_PDRCFG1, 5U),  /*!< Power Down HVD in VDD1 Domain.*/
    kPDRUNCFG_PD_AGDET_VDD1       = MAKE_PD_BITS(PMC_PDRCFG1, 6U),  /*!< Power Down AGDET in VDD1 Domain.*/
    kPDRUNCFG_LP_POR_VDD2         = MAKE_PD_BITS(PMC_PDRCFG1, 7U),  /*!< POR Low-Power Mode in VDD2 Domain.*/
    kPDRUNCFG_LP_LVD_VDD2         = MAKE_PD_BITS(PMC_PDRCFG1, 8U),  /*!< LVD Low-Power Mode in VDD2 Domain.*/
    kPDRUNCFG_PD_HVD_VDD2         = MAKE_PD_BITS(PMC_PDRCFG1, 9U),  /*!< Power Down HVD in VDD2 Domain.*/
    kPDRUNCFG_PD_AGDET_VDD2       = MAKE_PD_BITS(PMC_PDRCFG1, 10U), /*!< Power Down AGDET in VDD2 Domain.*/
    kPDRUNCFG_LP_POR_VDDN         = MAKE_PD_BITS(PMC_PDRCFG1, 11U), /*!< POR Low-Power Mode in VDDN Domain.*/
    kPDRUNCFG_LP_LVD_VDDN         = MAKE_PD_BITS(PMC_PDRCFG1, 12U), /*!< LVD Low-Power Mode in VDDN Domain.*/
    kPDRUNCFG_PD_HVD_VDDN         = MAKE_PD_BITS(PMC_PDRCFG1, 13U), /*!< Power Down HVD in VDDN Domain.*/
    kPDRUNCFG_PD_OTP              = MAKE_PD_BITS(PMC_PDRCFG1, 15U), /*!< Power Down OTP.*/
    kPDRUNCFG_PD_ROM              = MAKE_PD_BITS(PMC_PDRCFG1, 16U), /*!< Power Down ROM.*/
    kPDRUNCFG_APD_SRAM1           = MAKE_PD_BITS(PMC_PDRCFG2, 1U),  /*!< RAM Partition 1 Array Power Down. */
    kPDRUNCFG_APD_SRAM2           = MAKE_PD_BITS(PMC_PDRCFG2, 2U),  /*!< RAM Partition 2 Array Power Down. */
    kPDRUNCFG_APD_SRAM3           = MAKE_PD_BITS(PMC_PDRCFG2, 3U),  /*!< RAM Partition 3 Array Power Down. */
    kPDRUNCFG_APD_SRAM4           = MAKE_PD_BITS(PMC_PDRCFG2, 4U),  /*!< RAM Partition 4 Array Power Down. */
    kPDRUNCFG_APD_SRAM5           = MAKE_PD_BITS(PMC_PDRCFG2, 5U),  /*!< RAM Partition 5 Array Power Down. */
    kPDRUNCFG_APD_SRAM6           = MAKE_PD_BITS(PMC_PDRCFG2, 6U),  /*!< RAM Partition 6 Array Power Down. */
    kPDRUNCFG_APD_SRAM7           = MAKE_PD_BITS(PMC_PDRCFG2, 7U),  /*!< RAM Partition 7 Array Power Down. */
    kPDRUNCFG_APD_SRAM8           = MAKE_PD_BITS(PMC_PDRCFG2, 8U),  /*!< RAM Partition 8 Array Power Down. */
    kPDRUNCFG_APD_SRAM9           = MAKE_PD_BITS(PMC_PDRCFG2, 9U),  /*!< RAM Partition 9 Array Power Down. */
    kPDRUNCFG_APD_SRAM10          = MAKE_PD_BITS(PMC_PDRCFG2, 10U), /*!< RAM Partition 10 Array Power Down. */
    kPDRUNCFG_APD_SRAM11          = MAKE_PD_BITS(PMC_PDRCFG2, 11U), /*!< RAM Partition 11 Array Power Down. */
    kPDRUNCFG_APD_SRAM12          = MAKE_PD_BITS(PMC_PDRCFG2, 12U), /*!< RAM Partition 12 Array Power Down. */
    kPDRUNCFG_APD_SRAM13          = MAKE_PD_BITS(PMC_PDRCFG2, 13U), /*!< RAM Partition 13 Array Power Down. */
    kPDRUNCFG_APD_SRAM14          = MAKE_PD_BITS(PMC_PDRCFG2, 14U), /*!< RAM Partition 14 Array Power Down. */
    kPDRUNCFG_APD_SRAM15          = MAKE_PD_BITS(PMC_PDRCFG2, 15U), /*!< RAM Partition 15 Array Power Down. */
    kPDRUNCFG_APD_SRAM16          = MAKE_PD_BITS(PMC_PDRCFG2, 16U), /*!< RAM Partition 16 Array Power Down. */
    kPDRUNCFG_APD_SRAM17          = MAKE_PD_BITS(PMC_PDRCFG2, 17U), /*!< RAM Partition 17 Array Power Down. */
    kPDRUNCFG_APD_SRAM18          = MAKE_PD_BITS(PMC_PDRCFG2, 18U), /*!< RAM Partition 18 Array Power Down. */
    kPDRUNCFG_APD_SRAM19          = MAKE_PD_BITS(PMC_PDRCFG2, 19U), /*!< RAM Partition 19 Array Power Down. */
    kPDRUNCFG_APD_SRAM20          = MAKE_PD_BITS(PMC_PDRCFG2, 20U), /*!< RAM Partition 20 Array Power Down. */
    kPDRUNCFG_APD_SRAM21          = MAKE_PD_BITS(PMC_PDRCFG2, 21U), /*!< RAM Partition 21 Array Power Down. */
    kPDRUNCFG_APD_SRAM22          = MAKE_PD_BITS(PMC_PDRCFG2, 22U), /*!< RAM Partition 22 Array Power Down. */
    kPDRUNCFG_APD_SRAM23          = MAKE_PD_BITS(PMC_PDRCFG2, 23U), /*!< RAM Partition 23 Array Power Down. */
    kPDRUNCFG_APD_SRAM24          = MAKE_PD_BITS(PMC_PDRCFG2, 24U), /*!< RAM Partition 24 Array Power Down. */
    kPDRUNCFG_APD_SRAM25          = MAKE_PD_BITS(PMC_PDRCFG2, 25U), /*!< RAM Partition 25 Array Power Down. */
    kPDRUNCFG_APD_SRAM26          = MAKE_PD_BITS(PMC_PDRCFG2, 26U), /*!< RAM Partition 26 Array Power Down. */
    kPDRUNCFG_APD_SRAM27          = MAKE_PD_BITS(PMC_PDRCFG2, 27U), /*!< RAM Partition 27 Array Power Down. */
    kPDRUNCFG_APD_SRAM28          = MAKE_PD_BITS(PMC_PDRCFG2, 28U), /*!< RAM Partition 28 Array Power Down. */
    kPDRUNCFG_APD_SRAM29          = MAKE_PD_BITS(PMC_PDRCFG2, 29U), /*!< RAM Partition 29 Array Power Down. */
    kPDRUNCFG_PPD_SRAM1           = MAKE_PD_BITS(PMC_PDRCFG3, 1U),  /*!< RAM Partition 1 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM2           = MAKE_PD_BITS(PMC_PDRCFG3, 2U),  /*!< RAM Partition 2 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM3           = MAKE_PD_BITS(PMC_PDRCFG3, 3U),  /*!< RAM Partition 3 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM4           = MAKE_PD_BITS(PMC_PDRCFG3, 4U),  /*!< RAM Partition 4 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM5           = MAKE_PD_BITS(PMC_PDRCFG3, 5U),  /*!< RAM Partition 5 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM6           = MAKE_PD_BITS(PMC_PDRCFG3, 6U),  /*!< RAM Partition 6 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM7           = MAKE_PD_BITS(PMC_PDRCFG3, 7U),  /*!< RAM Partition 7 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM8           = MAKE_PD_BITS(PMC_PDRCFG3, 8U),  /*!< RAM Partition 8 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM9           = MAKE_PD_BITS(PMC_PDRCFG3, 9U),  /*!< RAM Partition 9 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM10          = MAKE_PD_BITS(PMC_PDRCFG3, 10U), /*!< RAM Partition 10 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM11          = MAKE_PD_BITS(PMC_PDRCFG3, 11U), /*!< RAM Partition 11 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM12          = MAKE_PD_BITS(PMC_PDRCFG3, 12U), /*!< RAM Partition 12 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM13          = MAKE_PD_BITS(PMC_PDRCFG3, 13U), /*!< RAM Partition 13 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM14          = MAKE_PD_BITS(PMC_PDRCFG3, 14U), /*!< RAM Partition 14 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM15          = MAKE_PD_BITS(PMC_PDRCFG3, 15U), /*!< RAM Partition 15 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM16          = MAKE_PD_BITS(PMC_PDRCFG3, 16U), /*!< RAM Partition 16 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM17          = MAKE_PD_BITS(PMC_PDRCFG3, 17U), /*!< RAM Partition 17 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM18          = MAKE_PD_BITS(PMC_PDRCFG3, 18U), /*!< RAM Partition 18 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM19          = MAKE_PD_BITS(PMC_PDRCFG3, 19U), /*!< RAM Partition 19 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM20          = MAKE_PD_BITS(PMC_PDRCFG3, 20U), /*!< RAM Partition 20 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM21          = MAKE_PD_BITS(PMC_PDRCFG3, 21U), /*!< RAM Partition 21 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM22          = MAKE_PD_BITS(PMC_PDRCFG3, 22U), /*!< RAM Partition 22 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM23          = MAKE_PD_BITS(PMC_PDRCFG3, 23U), /*!< RAM Partition 23 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM24          = MAKE_PD_BITS(PMC_PDRCFG3, 24U), /*!< RAM Partition 24 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM25          = MAKE_PD_BITS(PMC_PDRCFG3, 25U), /*!< RAM Partition 25 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM26          = MAKE_PD_BITS(PMC_PDRCFG3, 26U), /*!< RAM Partition 26 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM27          = MAKE_PD_BITS(PMC_PDRCFG3, 27U), /*!< RAM Partition 27 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM28          = MAKE_PD_BITS(PMC_PDRCFG3, 28U), /*!< RAM Partition 28 Periphery Power Down. */
    kPDRUNCFG_PPD_SRAM29          = MAKE_PD_BITS(PMC_PDRCFG3, 29U), /*!< RAM Partition 29 Periphery Power Down. */
    kPDRUNCFG_APD_SDHC0_SRAM      = MAKE_PD_BITS(PMC_PDRCFG4, 0U),  /*!< uSDHC0 SRAM array Power Down. */
    kPDRUNCFG_APD_SDHC1_SRAM      = MAKE_PD_BITS(PMC_PDRCFG4, 1U),  /*!< uSDHC1 SRAM array Power Down. */
    kPDRUNCFG_APD_USB0_SRAM       = MAKE_PD_BITS(PMC_PDRCFG4, 2U),  /*!< USB0 SRAM array Power Down. */
    kPDRUNCFG_APD_USB1_SRAM       = MAKE_PD_BITS(PMC_PDRCFG4, 3U),  /*!< USB1 SRAM array Power Down. */
    kPDRUNCFG_APD_JPEGDEC         = MAKE_PD_BITS(PMC_PDRCFG4, 4U),  /*!< Powers down JPEGDEC RAMs array. */
    kPDRUNCFG_APD_PNGDEC          = MAKE_PD_BITS(PMC_PDRCFG4, 5U),  /*!< Powers down PNGDEC RAMs array. */
    kPDRUNCFG_APD_MIPIDSI         = MAKE_PD_BITS(PMC_PDRCFG4, 6U),  /*!< Powers down MIPI PHY RAMs array. */
    kPDRUNCFG_APD_GPU             = MAKE_PD_BITS(PMC_PDRCFG4, 7U),  /*!< Powers down VGPU RAMs array. */
    kPDRUNCFG_APD_DMA2_3          = MAKE_PD_BITS(PMC_PDRCFG4, 8U),  /*!< Powers down DMA2 and DMA3 RAMs array. */
    kPDRUNCFG_APD_DMA0_1_PKC_ETF  = MAKE_PD_BITS(PMC_PDRCFG4, 9U),  /*!< Powers down DMA0-1, PKC, and ETF RAMs array. */
    kPDRUNCFG_APD_CPU0_CODE_CACHE = MAKE_PD_BITS(PMC_PDRCFG4, 10U), /*!< Powers down CPU0 code cache RAMs array. */
    kPDRUNCFG_APD_CPU0_SYSTEM_CACHE = MAKE_PD_BITS(PMC_PDRCFG4, 11U), /*!< Powers down CPU0 system cache RAMs array. */
    kPDRUNCFG_APD_DSP_ICACHE = MAKE_PD_BITS(PMC_PDRCFG4, 12U), /*!< Powers down HiFi4 instruction cache RAMs array. */
    kPDRUNCFG_APD_DSP_DCACHE = MAKE_PD_BITS(PMC_PDRCFG4, 13U), /*!< Powers down HiFi4 data cache RAMs array. */
    kPDRUNCFG_APD_DSP_ITCM   = MAKE_PD_BITS(PMC_PDRCFG4, 14U), /*!< Powers down HiFi4 instruction TCM RAMs array. */
    kPDRUNCFG_APD_DSP_DTCM   = MAKE_PD_BITS(PMC_PDRCFG4, 15U), /*!< Powers down HiFi4 data TCM RAMs array. */
    kPDRUNCFG_APD_EZHV_TCM   = MAKE_PD_BITS(PMC_PDRCFG4, 16U), /*!< Powers down EZH-V TCM RAMs array. */
    kPDRUNCFG_APD_NPU        = MAKE_PD_BITS(PMC_PDRCFG4, 17U), /*!< Powers down NPU RAMs array. */
    kPDRUNCFG_APD_XSPI0      = MAKE_PD_BITS(PMC_PDRCFG4, 18U), /*!< Powers down XSPI0, MMU0, and cache RAMs array. */
    kPDRUNCFG_APD_XSPI1      = MAKE_PD_BITS(PMC_PDRCFG4, 19U), /*!< Powers down XSPI1, MMU1, and cache RAMs array. */
    kPDRUNCFG_APD_XSPI2      = MAKE_PD_BITS(PMC_PDRCFG4, 20U), /*!< Powers down XSPI2 and MMU2 RAMs array. */
    kPDRUNCFG_APD_LCDIF      = MAKE_PD_BITS(PMC_PDRCFG4, 21U), /*!< Powers down LCDIF controller RAMs array. */
    kPDRUNCFG_APD_OCOTP      = MAKE_PD_BITS(PMC_PDRCFG4, 22U), /*!< Powers down OCOTP shadow RAMs array. */
    kPDRUNCFG_PPD_SDHC0_SRAM = MAKE_PD_BITS(PMC_PDRCFG5, 0U),  /*!< Powers down uSDHC0 RAMs periphery. */
    kPDRUNCFG_PPD_SDHC1_SRAM = MAKE_PD_BITS(PMC_PDRCFG5, 1U),  /*!< Powers down uSDHC1 RAMs periphery. */
    kPDRUNCFG_PPD_USB0_SRAM  = MAKE_PD_BITS(PMC_PDRCFG5, 2U),  /*!< Powers down USB0 RAMs periphery. */
    kPDRUNCFG_PPD_USB1_SRAM  = MAKE_PD_BITS(PMC_PDRCFG5, 3U),  /*!< Powers down USB1 RAMs periphery. */
    kPDRUNCFG_PPD_JPEGDEC    = MAKE_PD_BITS(PMC_PDRCFG5, 4U),  /*!< Powers down JPEGDEC RAMs periphery. */
    kPDRUNCFG_PPD_PNGDEC     = MAKE_PD_BITS(PMC_PDRCFG5, 5U),  /*!< Powers down PNGDEC RAMs periphery. */
    kPDRUNCFG_PPD_MIPIDSI    = MAKE_PD_BITS(PMC_PDRCFG5, 6U),  /*!< Powers down MIPI PHY RAMs periphery. */
    kPDRUNCFG_PPD_GPU        = MAKE_PD_BITS(PMC_PDRCFG5, 7U),  /*!< Powers down VGPU RAMs periphery. */
    kPDRUNCFG_PPD_DMA2_3     = MAKE_PD_BITS(PMC_PDRCFG5, 8U),  /*!< Powers down DMA2 and DMA3 RAMs periphery. */
    kPDRUNCFG_PPD_DMA0_1_PKC_ETF =
        MAKE_PD_BITS(PMC_PDRCFG5, 9U),                         /*!< Powers down DMA0-1, PKC, and ETF RAMs periphery. */
    kPDRUNCFG_PPD_CPU0_CODE_CACHE = MAKE_PD_BITS(PMC_PDRCFG5, 10U), /*!< Powers down CPU0 code cache RAMs periphery. */
    kPDRUNCFG_PPD_CPU0_SYSTEM_CACHE =
        MAKE_PD_BITS(PMC_PDRCFG5, 11U), /*!< Powers down CPU0 system cache RAMs periphery. */
    kPDRUNCFG_PPD_DSP_ICACHE =
        MAKE_PD_BITS(PMC_PDRCFG5, 12U), /*!< Powers down HiFi4 instruction cache RAMs periphery. */
    kPDRUNCFG_PPD_DSP_DCACHE = MAKE_PD_BITS(PMC_PDRCFG5, 13U), /*!< Powers down HiFi4 data cache RAMs periphery. */
    kPDRUNCFG_PPD_DSP_ITCM   = MAKE_PD_BITS(PMC_PDRCFG5, 14U), /*!< Powers down HiFi4 instruction TCM RAMs periphery. */
    kPDRUNCFG_PPD_DSP_DTCM   = MAKE_PD_BITS(PMC_PDRCFG5, 15U), /*!< Powers down HiFi4 data TCM RAMs periphery. */
    kPDRUNCFG_PPD_EZHV_TCM   = MAKE_PD_BITS(PMC_PDRCFG5, 16U), /*!< Powers down EZH-V TCM RAMs periphery. */
    kPDRUNCFG_PPD_NPU        = MAKE_PD_BITS(PMC_PDRCFG5, 17U), /*!< Powers down NPU RAMs periphery. */
    kPDRUNCFG_PPD_XSPI0 = MAKE_PD_BITS(PMC_PDRCFG5, 18U), /*!< Powers down XSPI0, MMU0, and cache RAMs periphery. */
    kPDRUNCFG_PPD_XSPI1 = MAKE_PD_BITS(PMC_PDRCFG5, 19U), /*!< Powers down XSPI1, MMU1, and cache RAMs periphery. */
    kPDRUNCFG_PPD_XSPI2 = MAKE_PD_BITS(PMC_PDRCFG5, 20U), /*!< Powers down XSPI2 and MMU2 RAMs periphery. */
    kPDRUNCFG_PPD_LCDIF = MAKE_PD_BITS(PMC_PDRCFG5, 21U), /*!< Powers down LCDIF controller RAMs periphery. */
    kPDRUNCFG_PPD_OCOTP = MAKE_PD_BITS(PMC_PDRCFG5, 22U), /*!< Powers down OCOTP shadow RAMs periphery. */
    /*
    This enum member has no practical meaning,it is used to avoid MISRA issue,
    user should not trying to use it.
    */
    kPDRUNCFG_ForceUnsigned = (int)0x80000000U,
} pd_bit_t;

