nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/drivers/fsl_power.h
/*******************************************************************************
 * API
 ******************************************************************************/

#ifdef __cplusplus
extern "C" {
#endif

/*!
 * @brief API to enable PDRUNCFG bit in the SLEEPCON and PMC. Note that enabling the bit powers down the peripheral
 *
 * @param en    peripheral for which to enable the PDRUNCFG bit
 */
void POWER_EnablePD(pd_bit_t en);

/*!
 * @brief API to disable PDRUNCFG bit in the SLEEPCON and PMC. Note that disabling the bit powers up the peripheral
 *
 * @param en    peripheral for which to disable the PDRUNCFG bit
 */
void POWER_DisablePD(pd_bit_t en);

/*!
 * @brief API to request a module entering low power. This API send low power/stop requests to a module and wait the
acknowledgement from the module. For peripherals that are being used by a domain, using this low power request handshake
is recommended to make sure the module is fully stopped before the module is powered down or clock gated.
 *
 * @param en    peripheral for which to enable the low power request.
 * @return  kStatus_Success for succeed, kStatus_Timeout for tiemout.
 */
status_t POWER_ModuleEnterLPRequest(lp_bit_t en);

/*!
 * @brief API to negate low power/stop requests to a module(module resume regular operation).
 *
 * @param en peripheral for which to disable the low power request.
 */
void POWER_ModuleExitLPRequest(lp_bit_t en);

/*!
 * @brief   Set PMIC_MODE pins configure value.
 * @param   mode : PMIC MODE pin value. This field is aggregated low.
 * @param   reg : PDSLEEPCFG0 or PDRUNCFG0 register offset
 * @return  PMIC_MODE pins value in PDSLEEPCFG0
 */
void POWER_SetPmicMode(uint32_t mode, pmic_mode_reg_t reg);

/**
 * @brief   Get PMIC_MODE pins configure value.
 * @param   reg : PDSLEEPCFG0 or PDRUNCFG0 register offset
 * @return  PMIC_MODE pins value in PDSLEEPCFG0 or PDRUNCFG0
 */
uint32_t POWER_GetPmicMode(pmic_mode_reg_t reg);

#if defined(PMC0)
/*!
 * @brief Configure pad voltage level for the 3V capable IOs(FLEXIO pads only) which have a dectector to sense the value
 * of supply. The Continuous cost more power due to enabled voltage detector.
 *
 * NOTE: BE CAUTIOUS TO CALL THIS API. IF THE PAD SUPPLY IS BEYOND THE SET RANGE, SILICON MIGHT BE DAMAGED.
 *
 * @param vrange pad voltage range.
 */
static inline void POWER_SetPio2VoltRange(power_pad_vrange_val_t vrange)
{
    PMC0->PADVRANGE = (uint32_t)vrange & PMC_PADVRANGE_VRANGE_MASK;
}
#endif

/*!
 * @brief API to enable deep sleep bit in the ARM Core.
 */
static inline void POWER_EnableDeepSleep(void)
{
    SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;
}

/*!
 * @brief API to disable deep sleep bit in the ARM Core.
 */
static inline void POWER_DisableDeepSleep(void)
{
    SCB->SCR &= ~SCB_SCR_SLEEPDEEP_Msk;
}

/*!
 * @brief API to apply updated PMC PDRUNCFG bits in the Sysctl0.
 */
void POWER_ApplyPD(void);

/**
 * @brief   Clears the PMC event flags state.
 * @param   statusMask : A bitmask of event flags that are to be cleared.
 */
void POWER_ClearEventFlags(uint32_t statusMask);

/**
 * @brief   Get the PMC event flags state.
 * @return  PMC FLAGS register value
 */
uint32_t POWER_GetEventFlags(void);

/*!
 * @brief   Enable the PMC interrupt requests.
 * @param   interruptMask : A bitmask of interrupts to enable.
 */
void POWER_EnableInterrupts(uint32_t interruptMask);

/*!
 * @brief   Disable the PMC interrupt requests.
 * @param   interruptMask : A bitmask of interrupts to disable.
 */
void POWER_DisableInterrupts(uint32_t interruptMask);

/*!
 * @brief   Enable the PMC reset requests.
 * @param   resetMask : A bitmask of Reset to enable, refer to PMC CTRL register descritpion in RM.
 */
void POWER_EnableResets(uint32_t resetMask);

/*!
 * @brief   Disable the PMC reset requests.
 * @param   resetMask : A bitmask of Reset to disable, refer to PMC CTRL register descritpion in RM.
 */
void POWER_DisableResets(uint32_t resetMask);

/*!
 * @brief Enable specific interrupt for wake-up from deep-sleep mode.
 * Enable the interrupt for wake-up from deep sleep mode.
 * Some interrupts are typically used in sleep mode only and will not occur during
 * deep-sleep mode because relevant clocks are stopped. However, it is possible to enable
 * those clocks (significantly increasing power consumption in the reduced power mode),
 * making these wake-ups possible.
 * @note This function also enables the interrupt in the NVIC (EnableIRQ() is called internally).
 * @param interrupt The IRQ number.
 */
void EnableDeepSleepIRQ(IRQn_Type interrupt);

/*!
 * @brief Disable specific interrupt for wake-up from deep-sleep mode.
 * Disable the interrupt for wake-up from deep sleep mode.
 * Some interrupts are typically used in sleep mode only and will not occur during
 * deep-sleep mode because relevant clocks are stopped. However, it is possible to enable
 * those clocks (significantly increasing power consumption in the reduced power mode),
 * making these wake-ups possible.
 * @note This function also disables the interrupt in the NVIC (DisableIRQ() is called internally).
 * @param interrupt The IRQ number.
 */
void DisableDeepSleepIRQ(IRQn_Type interrupt);

/*!
 * @brief Enable specific DMA channels to generate a wake-up from deep-sleep mode.
 * DMA wakeup is an automatic hardware mechanism that handles DMA transactions for selected modules without the need for
 * core processing. Software can configure individual DMA channels to generate a wakeup when they receive a DMA request.
 * The DMA wakeup triggers an exit from Deep Sleep mode except the core, which remains sleeping.
 * @param sources The bits mask for eDMA wakeup sources. Refers #_power_hwwake_src.
 */
void POWER_EnableDMAHWWake(uint32_t sources);

/*!
 * @brief Disable specific DMA channels to generate a wake-up from deep-sleep mode.
 * Disable the DMA channels for wake-up from deep sleep mode.
 * @param sources The bits mask for eDMA wakeup sources. Refers #_power_hwwake_src.
 */
void POWER_DisableDMAHWWake(uint32_t sources);

/*!
 * @brief   Configure PMC for auto wakeup.This feature allows PMC to wake up some amount of time after the domain enters
 * Deep Sleep. The timer is clocked by PMC's internal 16 MHz clock. If both timers in compute and sense are enabled at
 * the same time, wake-up will occur after BOTH timers time out (i.e. the max timeout value between the two is used).
 * @param   ticks : The ticks of 16MHz PMC internal clock to wait before waking up the domain after it goes to
 * DeepSleep.
 */
void POWER_EnableAutoWake(uint16_t ticks);

/*!
 * @brief Enable low power request masking for shared modules.
 * Enabling the mask will relinquish the caller domain's control over the module, and give the other domain exclusive
 * control over low-power requests to the module.
 * NOTE,  The masking of a shared module must NOT be disabled in both Compute and Sense domain.
 *
 * @param mask An OR'd bitmask of shared modules to be masked from low power request, ref @ref
 * _power_shared_resource_mask and SLEEPCON SHARED_MASK0 register in the RM. DeepSleep.
 */
void POWER_EnableLPRequestMask(uint32_t mask);

/*!
 * @brief Disable low power request masking for shared modules.
 * Disabling the mask means this domain will own the module. Only one domain should own each shared module.
 *
 * @param mask An OR'd bitmask of shared modules to be enabled from low power request, ref @ref
 * _power_shared_resource_mask and SLEEPCON SHARED_MASK0 register in the RM. DeepSleep.
 */
void POWER_DisableLPRequestMask(uint32_t mask);

/*!
 * @brief Enable AFBB mode for various domains in active mode.
 * AFBB mode should always be used for domains that are active/clocked.
 * Note, users should call POWER_ApplyPD() to make the change take effect.
 * @param mask : A bitmask of domains to enable AFBB mode, refer to @ref _body_bias_domain and PMC PDRUNCFG0 register
 * descritpion in RM.
 */
void POWER_EnableRunAFBB(uint32_t mask);

/*!
 * @brief Enable RBB mode for various domains in active mode.
 * This function should only be used when one CPU will not be making use of one of the voltage domains.Configuring the
 * unused voltages for RBB will allow the other domain to have full control of the body bias mode for the voltages even
 * when both domains are in run mode.
 * Note, users should call POWER_ApplyPD() to make the change take effect.
 * @param mask : A bitmask of domains to enable RBB mode, refer to @ref _body_bias_domain and PMC PDRUNCFG0 register
 * descritpion in RM.
 */
void POWER_EnableRunRBB(uint32_t mask);

/*!
 * @brief Enable RBB mode for various domains in deep sleep mode.
 * @param mask : A bitmask of domains to enable RBB mode, refer to @ref _body_bias_domain and PMC PDSLEEPCFG0 register
 * descritpion in RM.
 */
void POWER_EnableSleepRBB(uint32_t mask);

/*!
 * @brief Enable NBB mode for various domains in active mode.
 * NBB can be a lower power option than RBB if the domain enters and exits low-power modes frequently since the wells
 * don't charge and discharge as much on every entry/exit.
 * @param mask : A bitmask of domains to enable NBB mode, refer to @ref _body_bias_domain and PMC PDRUNCFG0 register
 * descritpion in RM.
 */
void POWER_EnableRunNBB(uint32_t mask);

/*!
 * @brief Enable NBB mode for various domains in deep sleep mode.
 * NBB can be a lower power option than RBB if the domain enters and exits low-power modes frequently since the wells
 * don't charge and discharge as much on every entry/exit.
 * @param mask : A bitmask of domains to enable NBB mode, refer to @ref _body_bias_domain and PMC PDSLEEPCFG0 register
 * descritpion in RM.
 */
void POWER_EnableSleepNBB(uint32_t mask);

#if defined(PMC0)

/*!
 * @brief Configure the voltage used for RBB mode for each voltage domain. The voltage specified here is used for any
 * mode where RBB is enabled.
 * @param config Voltage selection for each voltage domain.
 */
void POWER_ConfigRBBVolt(const power_rbb_voltage_t *config);

/*!
 * @brief Disable the on-chip regulators.
 * This function should be used to disable the on-chip regulators for any supplies that will be powered externally
 * (regulators are enabled by default. If disabled the regulators will keep power down until next cold reset).
 * @param mask A bitmask of regulators to be powered down, @ref _power_regulator_pd_control and PMC POWERCFG register
 * descripion in RM.
 */
void POWER_DisableRegulators(uint32_t mask);

/*!
 * @brief Enable the on-chip regulators for FDSR mode.
 * This function is used to enable the on-chip regulators for FDSR power mode.
 * Note, If the regulator is disabled globally(by POWER_DisableRegulators), then they will automatically be powered down
 * in all modes (using this API to request enabling them will have no effect).
 * @param mask A bitmask of regulators to be controlled, @ref _power_regulator_pd_control_fdsr and PMC POWERCFG register
descripion in RM.
*/
void POWER_EnableSleepRegulators(uint32_t mask);

/*!
 * @brief Disable the on-chip regulators for FDSR mode.
 * This function is used to enable the on-chip regulators for FDSR power mode.
 * Note, If the regulator is disabled globally(by POWER_DisableRegulators), then they will automatically be powered down
 * in all modes.
 * @param mask A bitmask of regulators to be controlled, @ref _power_regulator_control_fdsr and PMC POWERCFG register
 * descripion in RM.
 */
void POWER_DisableSleepRegulators(uint32_t mask);

/*!
 * @brief Set VDDN supply source, PMIC or on-chip regulator. When PMIC selected the on-chip regulator will be powered
 * down.
 * @param   src : #power_vdd_src_t, VDDN supply source
 */
void POWER_SetVddnSupplySrc(power_vdd_src_t src);

/*!
 * @brief Set VDD1 supply source, PMIC or on-chip regulator. When PMIC selected the on-chip regulator will be powered
 * down.
 * @param   src : #power_vdd_src_t, VDDN supply source
 */
void POWER_SetVdd1SupplySrc(power_vdd_src_t src);

/*!
 * @brief Set VDD2 supply source, PMIC or on-chip regulator. When PMIC selected the on-chip regulator will be powered
 * down.
 * @param   src : #power_vdd_src_t, VDDN supply source
 */
void POWER_SetVdd2SupplySrc(power_vdd_src_t src);

/*!
 * @brief API to configure the delay for PMIC mode changes.
 * Any time the PMIC_MODE pin values change the PMC will wait for the delay specified here to allow time for the
 * external voltages to settle. Delay time = 250ns * 2^value. Note, need call POWER_ApplyPD() to make the change take
 * effect.
 *
 * @param value Delay value, the calculated delay time(ns) = 250ns*2^value.
 */
void POWER_SetPMICModeDelay(uint8_t value);

/*!
 * @brief Sets the POR falling trip voltages in VDD1, VDD2, and VDDN domains.
 * When the supply voltage falls below the selected trip voltage, it triggers a cold reset.
 * Falling trip = 0.4 + 10 mV * value
 *
 * @param porVolt A bitmask of values to control VDD1, VDD2, VDDN POR voltage.
 */
void POWER_SetPORVoltage(const power_por_voltage_t *porVolt);
#endif /* PMC0 */

/*!
 * @brief Configure the setpoint operation for on-chip regulators and LVD.
 * This function can configure both the target output voltages and LVD levels for each setpoint. The setpoint that is
 * actually selected is controlled by the aggregated value of PDRUNCFG[xxx_VSEL] and PDSLEEPCFG0[xxx_VSEL]. Use the
 * POWER_SelectRunSetpoint() or POWER_SelectSleepSetpoint() to configure the setpoint selections. The voltages selected
 * for each regulator must also be in ascending order (VSEL0 <= VSEL1 <= VSEL2 <= VSEL3). The voltages selected for each
 * LVD must also be in ascending order (LVL0 <= LVL1 <= LVL2 <= LVL3).
 *
 * NOTE, Only valid regulator for sense domain is VDD1 LDO.
 * Note, LDOVDD1VSEL and LVDVDD1CTRL are shared between the compute and sense domains. There is no aggregation to
 * combine the values. Whichever domain wrote the register last determines the value. It is recommended that only one
 * domain be used to configure VDD1 setpoints.
 *
 * @code
 *   const power_regulator_voltage_t regulator = {
 *     .LDO.vsel0 = 700000,
 *     .LDO.vsel1 = 800000,
 *     .LDO.vsel2 = 900000,
 *     .LDO.vsel3 = 1000000,
 *   };
 *   const power_lvd_voltage_t lvd = {
 *     .VDD12.lvl0 = 600000,
 *     .VDD12.lvl1 = 700000,
 *     .VDD12.lvl2 = 800000,
 *     .VDD12.lvl3 = 900000,
 *   };
 *
 *   ret = POWER_ConfigRegulatorSetpoints(kRegulator_Vdd1LDO, &regulator, &lvd);
 * @endcode
 * @param regulator which regulator or power domain to configure, refer to @ref power_regulator_t.
 * @param volt regulator configuration pointer, refer to @ref power_regulator_voltage_t. Note, only two setpoints are
 * available for DCDC.
 * @param lvd LVD voltage configuration, refer to @ref power_lvd_voltage_t.
 * @return kStatus_Success for succeed, kStatus_InvalidArgument for wrong arguments.
 */
status_t POWER_ConfigRegulatorSetpoints(power_regulator_t regulator,
                                        const power_regulator_voltage_t *volt,
                                        const power_lvd_voltage_t *lvd);

/*!
 * @brief Configure the setpoint operation for LVD.
 * This function can configure LVD levels for each setpoint. The setpoint that is actually selected is controlled by
 * the aggregated value of PDRUNCFG[xxx_VSEL] and PDSLEEPCFG0[xxx_VSEL]. Use the POWER_SelectRunSetpoint() or
 * POWER_SelectSleepSetpoint() to configure the setpoint selections. The voltages selected for each LVD must be in
 * ascending order (LVL0 <= LVL1 <= LVL2 <= LVL3).
 *
 * NOTE, Only valid regulator for sense domain is VDD1 LDO.
 * Note, LDOVDD1VSEL and LVDVDD1CTRL are shared between the compute and sense domains. There is no aggregation to
 * combine the values. Whichever domain wrote the register last determines the value. It is recommended that only one
 * domain be used to configure VDD1 setpoints.
 *
 * @code
 *   const power_lvd_voltage_t lvd = {
 *     .VDD12.lvl0 = 600000,
 *     .VDD12.lvl1 = 700000,
 *     .VDD12.lvl2 = 800000,
 *     .VDD12.lvl3 = 900000,
 *   };
 *
 *   ret = POWER_ConfigLvdSetpoints(kRegulator_Vdd1LDO, &lvd);
 * @endcode
 * @param regulator which regulator or power domain to configure, refer to @ref power_regulator_t.
 * @param lvd LVD voltage configuration, refer to @ref power_lvd_voltage_t.
 * @return kStatus_Success for succeed, kStatus_InvalidArgument for wrong arguments.
 */
status_t POWER_ConfigLvdSetpoints(power_regulator_t regulator, const power_lvd_voltage_t *lvd);

/*!
 * @brief Get the LVD setpoints configurations.
 * This function can get the LVD levels for each setpoint. The setpoint that is actually selected is controlled by
 * the aggregated value of PDRUNCFG[xxx_VSEL] and PDSLEEPCFG0[xxx_VSEL].
 *
 * NOTE, Only valid regulator for sense domain is VDD1 LDO.
 *
 * @param regulator which regulator or power domain to get, refer to @ref power_regulator_t.
 * @param lvd LVD voltage configuration, refer to @ref power_lvd_voltage_t.
 */
void POWER_GetLvdSetpoints(power_regulator_t regulator, power_lvd_voltage_t *lvd);

/*!
 * @brief Select the setpoint(target voltage and LVD threshold) for active mode.
 * The requests from the compute and sense domains are aggregated, so depending on the other
domain's configuration the setpoint might not change or might change later (when the other domain
also requests a setpoint change).
 * Note, users should call POWER_ApplyPD() to make the change take effect.
 *
 * @param regulator which regulator or power domain to configure, refer to @ref power_regulator_t.
 * @param setpoint select which setpoint is used. Valid options for DCDC are 0-1. Valid options for VDD1/VDD2 are 0-3.
 */
void POWER_SelectRunSetpoint(power_regulator_t regulator, uint32_t setpoint);

/*!
 * @brief Select setpoint(target voltage and LVD threshold) in Deep Sleep (or lower) mode.
 * Use POWER_ConfigRegulatorSetpoints() to change the target voltage and/or LVD threshold value corresponding to each
 * setpoint. The requests from the compute and sense domains are aggregated,
 *
 * @param regulator which regulator or power domain to configure, refer to @ref power_regulator_t.
 * @param setpoint select which setpoint is used. Valid options for DCDC are 0-1. Valid options for VDD1/VDD2 are 0-3.
 */
void POWER_SelectSleepSetpoint(power_regulator_t regulator, uint32_t setpoint);

/*!
 * @brief Set the on-chip regulator mode in Run/Active mode.
 * The requests from the compute and sense domains are aggregated.
 *
 * @param regulator which regulator or power domain to configure, refer to @ref power_regulator_t.
 * @param mode set the workmode. Refer to @ref _power_dcdc_mode for available DCDC modes, refer to @ref _power_ldo_mode
 * for LDO available modes.
 */
void POWER_SetRunRegulatorMode(power_regulator_t regulator, uint32_t mode);

/*!
 * @brief Set the on-chip regulator mode in Deep Sleep mode.
 * The requests from the compute and sense domains are aggregated.
 *
 * @param regulator which regulator or power domain to configure, refer to @ref power_regulator_t.
 * @param mode set the workmode. Refer to @ref _power_dcdc_mode for available DCDC modes, refer to @ref _power_ldo_mode
 * for LDO available modes.
 */
void POWER_SetSleepRegulatorMode(power_regulator_t regulator, uint32_t mode);

/*!
 * @brief Reset the IO bank.
 * Sets the IO bank reset which tristates the ports. Intended to be used prior to powering off the VDDIO supplies.
 *
 * @param mask A bitmask of IO Banks to be reseted, @ref power_io_bank_t and PMC PADCFG register. The register reset by
 * cold reset.
 */
void POWER_ResetIOBank(uint32_t mask);

/*!
 * @brief IO Bank Isolation Hold.
 *  Maintains IO bank isolation state after wake-up from FDSR/DPD modes. If clear, the IO bank's state will be retained
 * during FDSR & DPD modes, but will be controllable after wake-up. If set, the IO bank will remain in retain mode until
 * ISOCTRL cleared by software.
 *
 * @param mask A bitmask of IO Banks to be set, @ref power_io_bank_t and PMC PADCFG register. The register reset by cold
 * reset.
 */
void POWER_IOBankIsolationHold(uint32_t mask);

/*!
 * @brief Clear the IO bank Isolation Hold and regain state control.
 * This bit cannot be cleared if associated domain is not powered.
 *
 * @param mask A bitmask of IO Banks to be clear, @ref power_io_bank_t and PMC PADCFG register. The register reset by
 * cold reset.
 */
void POWER_IOBankClearIsolationHold(uint32_t mask);

/**
 * @brief   Configures and enters in SLEEP low power mode
 */
void POWER_EnterSleep(void);

/*!
 * @brief PMC Deep Sleep function call
 *
 * NOTE, the body bias and DCDC, LDO configurations in PMC_PDSLEECFG0 is not covered by this API, please use
 * @ref POWER_EnableSleepRBB or @ref POWER_EnableSleepNBB and @ref POWER_SelectSleepSetpoint for those settings.
 *
 * NOTE, the MAINPLL and AUDIO PLL need special power up sequence, so it can't be power down/on automatically during the
 * mode change. Application need turn off the PLL before the low power mode entry and re-initialize the PLL after
 * wakeup.
 * @param   exclude_from_pd  Bit mask of the SLEEPCON_SLEEPCFG and PMC_PDSLEEPCFG0 ~ PMC_PDSLEEPCFG5 that needs to be
 * powered on during Deep Sleep mode. The configuration for PMC from Compute domain and Sense domain are aggregated, and
 * the higher power mode always wins.
 */
void POWER_EnterDeepSleep(const uint32_t exclude_from_pd[7]);

